#### 📖 Terraform Plan ('infra-pe/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
module.vpn.data.azuread_application.vpn_app: Still reading... [10s elapsed]
module.vpn.data.azuread_application.vpn_app: Still reading... [20s elapsed]
module.vpn.data.azuread_application.vpn_app: Still reading... [30s elapsed]
module.vpn.data.azuread_application.vpn_app: Still reading... [40s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["active_connections"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-ACTIVE_CONNECTIONS"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "active_connections"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["connections_failed"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-CONNECTIONS_FAILED"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Total"
          + metric_name            = "connections_failed"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["cpu_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-CPU_PERCENT"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["memory_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-MEMORY_PERCENT"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_monitor_metric_alert.this["storage_percent"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + enabled                  = false
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-01-STORAGE_PERCENT"
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT30M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_postgresql_flexible_server.this will be created
  + resource "azurerm_postgresql_flexible_server" "this" {
      + administrator_login           = (sensitive value)
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = true
      + backup_retention_days         = 14
      + create_mode                   = "Default"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-cgn-pe-postgresql-psql-01"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = false
      + resource_group_name           = "io-p-itn-cgn-pe-rg-01"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 262144
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + version                       = "16"

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 3
          + start_hour   = 2
          + start_minute = 0
        }
    }

  # module.postgresql_db.module.postgresql_db.azurerm_private_endpoint.postgre_pep will be created
  + resource "azurerm_private_endpoint" "postgre_pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-cgn-pe-postgresql-psql-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-cgn-pe-rg-01"
      + subnet_id                = "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-cgn-pe-vnet-01/subnets/io-p-itn-cgn-pe-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/74da48a3-b0e7-489d-8172-da79801086ed/resourceGroups/io-p-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-cgn-pe-postgresql-psql-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.vpn.module.dns_forwarder.azurerm_container_group.this will be created
  + resource "azurerm_container_group" "this" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Private"
      + location                    = "italynorth"
      + name                        = "io-p-itn-dns-forwarder-ci-01"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "io-p-itn-cgn-pe-rg-01"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + subnet_ids                  = (known after apply)
      + tags                        = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }

      + container {
          + commands = [
              + "/coredns",
              + "-conf",
              + "/app/conf/Corefile",
            ]
          + cpu      = 0.5
          + image    = "coredns/coredns:1.10.1@sha256:be7652ce0b43b1339f3d14d9b14af9f588578011092c1f7893bd55432d83a378"
          + memory   = 0.5
          + name     = "dns-forwarder"

          + ports {
              + port     = 53
              + protocol = "UDP"
            }

          + volume {
              + empty_dir  = false
              + mount_path = "/app/conf"
              + name       = "dns-forwarder-conf"
              + read_only  = true
              + secret     = (sensitive value)
            }
        }
    }

  # module.vpn.module.dns_forwarder.null_resource.secret_trigger will be created
  + resource "null_resource" "secret_trigger" {
      + id       = (known after apply)
      + triggers = {
          + "trigger" = "Ljo1MyB7CiAgICBlcnJvcnMKICAgIHJlYWR5CiAgICBoZWFsdGgKICAgIGZvcndhcmQgLiAxNjguNjMuMTI5LjE2CiAgICBjYWNoZSAzMAogICAgbG9vcAogICAgcmVsb2FkCn0K"
        }
    }

  # module.vpn.module.dns_forwarder_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.26.252.8/29",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-dns-forwarder-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "io-p-itn-cgn-pe-rg-01"
      + virtual_network_name                           = "io-p-itn-cgn-pe-vnet-01"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.ContainerInstance/containerGroups"
            }
        }
    }

  # module.vpn.module.vpn.azurerm_public_ip.gw[0] will be created
  + resource "azurerm_public_ip" "gw" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "italynorth"
      + name                    = "io-p-itn-vgw-01-gw-pip"
      + resource_group_name     = "io-p-itn-cgn-pe-rg-01"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
    }

  # module.vpn.module.vpn.random_string.dns will be created
  + resource "random_string" "dns" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vpn.module.vpn_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.26.133.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "GatewaySubnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "io-p-itn-cgn-pe-rg-01"
      + virtual_network_name                           = "io-p-itn-cgn-pe-vnet-01"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.networking.module.pep_snet.azurerm_subnet.this,
  on .terraform/modules/networking.pep_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 12 more similar warnings elsewhere)

Error: Listing applications for filter "displayName eq 'cgnonboardingportal-p-app-vpn'"

  with module.vpn.data.azuread_application.vpn_app,
  on ../_modules/vpn/data.tf line 1, in data "azuread_application" "vpn_app":
   1: data "azuread_application" "vpn_app" {

unexpected status 403 (403 Forbidden) with error:
Authorization_RequestDenied: Insufficient privileges to complete the
operation.
::error::Terraform exited with code 1.
```

</details>
